Repository: gabriel-canals/FitBro
Catalog: lib/l10n/app_*.arb
Languages: it

source: Restart
it: Ricomincia

# waiting
source: Wait for a moment...
it: Aspetta un momento...

# generic_error
source: An error occurred.
it: C'è stato un errore.

# register_generic_error
source: Failed to register. Please try again later!
it: Errore durante la registrazione. Per favore riprovare più tardi!

# register_invalid_email_error
source: Invalid email address. Please try another one!
it: E-mail non valido. Per favore provalo con un'altra!

# register_email_in_use_error
source: This email is already in use. Please choose another email!
it: Questa e-mail è già in uso. Scegli un'altra email!

# login_generic_error
source: Failed to log in. Please try again later!
it: Errore di login. Per favore riprova più tardi!

# login_wrong_password_error
source: Wrong password. Please try again.
it: Password errata. Per favore riprova.

# login_user_not_found_error
source: User not found. Please try again.
it: Utente non trovato. Per favore riprova.

# forgot_password_view_generic_error
source: We could not process your request. Please make sure that you are a registered user. If not, register a user now by going back one step.
it: Non è stato possibile elaborare la tua richiesta. Assicurati di essere un utente registrato. In caso contrario, registra subito un utente tornando a Creare un Account.

source: Register
it: Creare un Account

# register_view_prompt
source: Please provide email and password to create an account.
it: Per favore, fornisce un'e-mail e una password per creare il tuo account.

# register_view_already_registered
source: I already have an account.
it: Ho già un account.

# login
source: Sign in
it: Login

# login_view_prompt
source: Insert your email and password to access your account
it: Inserisci la tua email e la password per accedere al tuo account.

# login_view_not_registered_yet
source: Yo don't have an account? Create one here!
it: Non sei ancora registrato? Crea il tuo account qui!

# login_view_forgot_password
source: I forgot my password.
it: Ho dimenticato la mia password.

# verify_email
source: Email Verification
it: Verifica Email

# verify_email_send_email_verification
source: We've sent you an email verification. Please follow the instructions to verify your account. If you haven't received a verification email yet, press the button below!
it: Ti inviamo un'e-mail di verifica. Seguire le loro istruzioni per verifica il tuo account. Se non hai ancora ricevuto l'e-mail di verifica, ¡premi il pulsante qui sotto!

# verify_email_prompt
source: Send email verification
it: Invia email di verifica

source: Password Reset
it: Reimpostazione della Password

# password_reset_dialog_prompt
source: We have now sent you a password reset link. Please check your inbox for more information.
it: Ti abbiamo inviato un link per reimpostare la sua password. Controlla la tua casella di posta per ulteriori informazioni.

# forgot_password
source: Forgotten Password
it: Password Dimenticata

# forgot_password_back_to_login
source: Back to login page
it: Torna alla Pagina di Accesso

# forgot_password_send_me_reset
source: Send me a password reset link
it: Inviami un collegamento per la reimpostazione della password.

# forgot_password_view_prompt
source: If you forgot your password, simply enter your email and we will send you a password reset link.
it: Se hai dimenticato la password, inserisci la tua email e ti invieremo un link per reimpostare la password.

# overview
source: My FitBro
it: Il Mio FitBro

source: Training
it: Allenamento

source: Diet
it: Dieta

source: Settings
it: Collocamento

source: Monday
it: Lunedi

source: Saturday
it: Sabato

source: Sunday
it: Domenica

# setting_week_first_day
source: First day of the week
it: Il primo giorno della settimana

# setting_language
source: Language
it: Lingua

# setting_height_unit
source: Height unit
it: Unità di altezza

# setting_distance_unit
source: Distance unit
it: Unità di distanza

# setting_weight_unit
source: Weight unit
it: Unità di peso
